saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Maxim.MAX32620.1.0.2.pdsc
      <component Cclass="Communications" Cgroup="SPI Master" Cversion="1.0.1" condition="MAX32620 CMSIS SPI Master">
         <description>SPI Master Interface</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32620PeriphDriver/Source/spim.c" version="1.0.1"/>
         </files>
      </component>

      <component Cclass="Communications" Cgroup="SPI Slave" Cversion="1.0.1" condition="MAX32620 CMSIS SPI Slave">
         <description>SPI Slave Interface</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32620PeriphDriver/Source/spis.c" version="1.0.1"/>
         </files>
      </component>

      <component Cclass="Communications" Cgroup="SPI XIP" Cversion="1.0.1" condition="MAX32620 CMSIS SPI XIP">
         <description>SPI eXecute In Place (XIP) Interface</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32620PeriphDriver/Source/spix.c" version="1.0.1"/>
         </files>
      </component>
      <component Cclass="Trust Protection Unit" Cgroup="MAA" Cversion="1.0.1" condition="MAX32621 CMSIS MAA">
         <description>MAA Interface</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32620PeriphDriver/Source/maa.c" version="1.0.1"/>
         </files>
      </component>

      <component Cclass="Communications" Cgroup="1-Wire Master" Cversion="1.0.1" condition="MAX32620 CMSIS 1-Wire">
         <description>1-Wire Master Interface</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32620PeriphDriver/Source/owm.c" version="1.0.1"/>
         </files>
      </component>

      <component Cclass="Peripherals" Cgroup="PMU" Cversion="1.0.1" condition="MAX32620 CMSIS PMU">
         <description>Peripheral Management Unit(PMU) for DMA</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32620PeriphDriver/Source/pmu.c" version="1.0.1"/>
         </files>
      </component>

      <component Cclass="Peripherals" Cgroup="Pulse Train" Cversion="1.0.1" condition="MAX32620 CMSIS Pulse Train">
         <description>Pulse Train (PWM) Controller</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32620PeriphDriver/Source/pt.c" version="1.0.1"/>
         </files>
      </component>

      <component Cclass="Peripherals" Cgroup="RTC" Cversion="1.0.1" condition="MAX32620 CMSIS RTC">
         <description>Real Time Clock Interface</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32620PeriphDriver/Source/rtc.c" version="1.0.1"/>
         </files>
      </component>

      <component Cclass="Peripherals" Cgroup="Flash IAP" Cversion="1.0.1" condition="MAX32620 CMSIS Flash IAP">
         <description>Flash In-Application Programming Interface</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32620PeriphDriver/Source/flc.c" version="1.0.1"/>
         </files>
      </component>

      <component Cclass="Peripherals" Cgroup="Timers" Cversion="1.0.1" condition="MAX32620 CMSIS TIMER">
         <description>32/16 Bit Timers</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32620PeriphDriver/Source/tmr.c" version="1.0.1"/>
            <file category="sourceC" name="Libraries/MAX32620PeriphDriver/Source/tmr_utils.c" version="1.0.1"/>
         </files>
      </component>

      <component Cclass="Peripherals" Cgroup="WDT" Csub="WDT1" Cversion="1.0.1" condition="MAX32620 CMSIS WDT1">
         <description>Watchdog Timer 1</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32620PeriphDriver/Source/wdt.c" version="1.0.1"/>
         </files>
      </component>

      <component Cclass="Peripherals" Cgroup="WDT" Csub="WDT2" Cversion="1.0.1" condition="MAX32620 CMSIS WDT2">
         <description>Watchdog Timer 2</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32620PeriphDriver/Source/wdt2.c" version="1.0.1"/>
         </files>
      </component>

      <component Cclass="Communications" Cgroup="UART" Cversion="1.0.1" condition="MAX32620 CMSIS UART">
         <description>UART Interface</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32620PeriphDriver/Source/uart.c" version="1.0.1"/>
         </files>
      </component>

      <bundle Cbundle="MAX32620 EVKIT Board Support" Cclass="BSP" Cversion="1.0.1">
         <description>MAX32620 Evaluation Kit Board Support Package</description>
         <doc>Documents/MAX32620_EVKIT_Datasheet.pdf</doc>
         <component Cgroup="Board Support" condition="MAX32620 BSP">
            <description>MAX32620 Evaluation Kit Board Setup</description>
            <RTE_Components_h>
               <!-- the following content goes into file 'RTE_Components.h' -->
               #define BOARD EvKit_V1
            </RTE_Components_h>
            <files>
               <file category="doc" name="Documents/MAX32620_EVKIT_Datasheet.pdf"/>
               <file category="doc" name="Documents/MAX32620_EVKIT_Schematic.pdf"/>
               <file category="include" name="Boards/Maxim/MAX32620_EVKIT/Common/EvKit_V1/Include/"/>
               <file category="include" name="Boards/Maxim/MAX32620_EVKIT/Common/Include/"/>
               <file category="sourceC" name="Boards/Maxim/MAX32620_EVKIT/Common/EvKit_V1/Source/board.c" version="1.0.1"/>
               <file category="sourceC" name="Boards/Maxim/MAX32620_EVKIT/Common/Source/stdio.c" version="1.0.1"/>
               <file category="sourceC" name="Boards/Maxim/MAX32620_EVKIT/Common/Source/nhd12832.c" version="1.0.1"/>
               <file category="sourceC" name="Boards/Maxim/MAX32620_EVKIT/Common/Source/pb.c" version="1.0.1"/>
               <file category="sourceC" name="Boards/Maxim/MAX32620_EVKIT/Common/Source/led.c" version="1.0.1"/>
               <file category="sourceC" name="Boards/Maxim/MAX32620_EVKIT/Common/Source/max14690.c" version="1.0.1"/>
               <file category="sourceC" name="Boards/Maxim/MAX32620_EVKIT/Common/Source/mx25.c" version="1.0.1"/>
            </files>
         </component>
      </bundle>

      <bundle Cbundle="MAXUSB Libraries" Cclass="MAXUSB" Cversion="1.0.1">
         <description>MAXUSB Libraries for the Maxim Integrated ARM Cortex Family of Microcontrollers</description>
         <doc>Documents/MAX32620_EVKIT_Datasheet.pdf</doc>
         <component Cgroup="MAXUSB" condition="Maxim USB">
            <description>Maxim Integrated USB libraries for the ARM Cortex.</description>
            <files>
               <file category="include" name="Libraries/MAXUSB/include/"/>
               <file category="include" name="Libraries/MAXUSB/include/core/"/>
               <file category="include" name="Libraries/MAXUSB/include/devclass/"/>
               <file category="include" name="Libraries/MAXUSB/include/enumerate/"/>
               <file category="include" name="Libraries/MAXUSB/include/core/arm/"/>
               <file category="sourceC" name="Libraries/MAXUSB/src/core/arm/usb.c" version="1.0.1" />
               <file category="sourceC" name="Libraries/MAXUSB/src/core/usb_event.c" version="1.0.1" />
               <file category="sourceC" name="Libraries/MAXUSB/src/devclass/fifo.c" version="1.0.1" />
               <file category="sourceC" name="Libraries/MAXUSB/src/devclass/cdc_acm.c" version="1.0.1" />
               <file category="sourceC" name="Libraries/MAXUSB/src/devclass/hid_kbd.c" version="1.0.1" />
               <file category="sourceC" name="Libraries/MAXUSB/src/devclass/hid_raw.c" version="1.0.1" />
               <file category="sourceC" name="Libraries/MAXUSB/src/enumerate/enumerate.c" version="1.0.1" />
            </files>
         </component>
      </bundle>

   </components>

</package>
